app/views/good_memories/index.html.erb

      <div class="text-3xl font-bold text-green-600 mb-2">
        <%= GoodMemory.where(mood: ['good', 'very_good']).count %>
---
SELECT COUNT(*) FROM "good_memories" WHERE "good_memories"."mood" IN ($1, $2)  [["mood", 4], ["mood", 5]]