app/controllers/good_memories_controller.rb

SELECT COUNT(*) FROM "good_memories"
SELECT "good_memories".* FROM "good_memories" WHERE "good_memories"."date" = $1 LIMIT $2  [["date", "2025-07-04"], ["LIMIT", 1]]
---
  def index
    @good_memories = GoodMemory.recent.limit(10)
    @total_count = GoodMemory.count
    @this_month_count = GoodMemory.this_month.count

    # 今日の記録があるかチェック
    @today_record = GoodMemory.find_by(date: Date.current)

INSERT INTO "good_memories" ("content", "date", "mood", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "アイス食べた"], ["date", "2025-07-07"], ["mood", 3], ["created_at", "2025-07-06 23:35:59.040042"], ["updated_at", "2025-07-06 23:35:59.040042"]]
---
  def create
    @good_memory = GoodMemory.new(good_memory_params)

    if @good_memory.save

UPDATE "good_memories" SET "mood" = $1, "updated_at" = $2 WHERE "good_memories"."id" = $3  [["mood", 2], ["updated_at", "2025-07-04 12:33:45.283786"], ["id", 1]]
---
  def update
    if @good_memory.update(good_memory_params)

SELECT "good_memories".* FROM "good_memories" WHERE "good_memories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_good_memory
    @good_memory = GoodMemory.find(params[:id])